<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"aa4bad8f4540949e1ae48532b7d8f9e9f6f6993f176727cde900757a55ce07e5","plan_job_ref":"Job Terraform plan #67 at https://github.com/mkuthan/stream-processing/actions/runs/9868919243","plan_out_hash":"878783e62c23b9ec9b4728688ec7f5ed6b64719c066972240670c344a44ed318","plan_hash":"a8e612d200405b18ea79bd22cb79aacb4c79b5dd666fba93944d4937db74eeeb","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __toll-infrastructure__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_pubsub_subscription.toll-booth-entry-subscription will be created
+   resource "google_pubsub_subscription" "toll-booth-entry-subscription" {
+       ack_deadline_seconds       = (known after apply)
+       effective_labels           = (known after apply)
+       id                         = (known after apply)
+       message_retention_duration = "604800s"
+       name                       = "toll-booth-entry"
+       project                    = "playground-272019"
+       terraform_labels           = (known after apply)
+       topic                      = "projects/playground-272019/topics/toll-booth-entry"
    }

  # google_pubsub_subscription.toll-booth-exit-subscription will be created
+   resource "google_pubsub_subscription" "toll-booth-exit-subscription" {
+       ack_deadline_seconds       = (known after apply)
+       effective_labels           = (known after apply)
+       id                         = (known after apply)
+       message_retention_duration = "604800s"
+       name                       = "toll-booth-exit"
+       project                    = "playground-272019"
+       terraform_labels           = (known after apply)
+       topic                      = "projects/playground-272019/topics/toll-booth-exit"
    }

  # google_pubsub_subscription.vehicle-registration-subscription will be created
+   resource "google_pubsub_subscription" "vehicle-registration-subscription" {
+       ack_deadline_seconds       = (known after apply)
+       effective_labels           = (known after apply)
+       id                         = (known after apply)
+       message_retention_duration = "604800s"
+       name                       = "vehicle-registration"
+       project                    = "playground-272019"
+       terraform_labels           = (known after apply)
+       topic                      = "projects/playground-272019/topics/vehicle-registration"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan #67](https://github.com/mkuthan/stream-processing/actions/runs/9868919243)